---
kind: type
id: T:Autodesk.Revit.DB.Visual.GlazingTransmittanceColorType
source: html/d139e460-78dd-5ded-c7db-7363d5d4c510.htm
---
# Autodesk.Revit.DB.Visual.GlazingTransmittanceColorType

The enumerated type representing the permitted values for the asset property "GlazingTransmittanceColor" from the "Glazing" schema.

## Syntax (C#)
```csharp
public enum GlazingTransmittanceColorType
```